hpc_qb/template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          200;
        startFace       79600;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       79800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80200;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       80400;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       120400;
    }
)

// ************************************************************************* //
